{"profiles": [" The patient is a 22 year old male with right shoulder pain for 2 weeks after being tackled in a rugby match. He has reduced range of motion and tenderness in the shoulder. His Sulcus sign, Apprehension test, and O'Brien test are all positive. An initial shoulder X-Ray shows no fracture or dislocation.\n", " The patient is a 43 year old male with a known diagnosis of ankylosing spondylitis. He is currently on infliximab treatment. There are no breakthrough symptoms, fever, loss of weight/appetite, abnormal sensation/weakness, or shortness of breath. A baseline MRI was done before treatment.\n", " The patient is a 38-year-old male with no significant past medical history. He has an injury to his right wrist caused by a power drill. He has a wound on the dorsum of his right wrist, swelling, and is unable to assess range of motion due to pain. No imaging has been performed yet.\n\n", " The patient is a 17 year old female with persistent pain in her left hand following a possible splinter penetration during a wood crafting workshop. There is mild swelling at the left thenar eminence and tenderness, but no significant erythema or obvious foreign body. The initial X-ray was unremarkable.\n", " The patient is a 28 year old female with no significant past medical history. She experienced pain at the lateral aspect of her right hand after kickboxing sparring. Examination revealed a deformity over her right 4th metacarpophalangeal joint, which was tender and swollen. X-rays showed a 4th metacarpophalaneal joint dislocation with no fracture.\n", " The patient is a 78-year-old female with a history of diabetes mellitus and hypertension. She tripped and fell and is now unable to walk due to left hip pain. Her left limb is foreshortened, externally rotated, and has a reduced range of motion due to pain. No imaging has been performed yet.\n", " The patient is a 45 year old female with a history of end stage renal failure, anemia, hypertension, and chronic headache. She slipped in the bathroom and is now unable to get up due to right hip pain. Examination shows no significant right limb foreshortening or external rotation, minor abrasions over thigh and calf, and reduced range of motion of right hip due to pain. X-rays show no obvious hip fracture or dislocation.\n\n", " The patient is a 50-year-old male with a history of hypertension. He experienced a twisting injury to his right ankle while jogging a week ago and has had pain since then. He was able to continue jogging immediately after the incident and is currently able to walk normally. There is mild pain on foot supination but no point tenderness at the right ankle or midfoot. There has been no prior imaging.\n", " The patient is a 17-year-old male with no significant past medical history. He was playing soccer when he was tackled by another player, resulting in a twisted right ankle. He was unable to walk for about 10 minutes after the incident but was subsequently able to bear weight with assistance. Examination revealed point tenderness at the tip of the lateral malleolus and abnormal widening of the lateral ankle on varus stress. X-rays showed no fracture, dislocation, or osteochondral injury.\n\n", " The patient is a 24 year old male with no significant past medical history. He is a construction worker who had a large trolley carrying metal poles roll over his left foot. He is experiencing severe pain and is unable to walk without assistance. His foot is severely swollen and tender over the midfoot/base of the forefoot. X-rays show equivocal widening of the interval between the base of the 1st and 2nd metatarsals, but no definite fracture.\n", " The patient is a 62 year old Caucasian female who was involved in a car accident where she hit her left knee on the dashboard. She is experiencing severe swelling and pain in her left knee, and has not had any imaging done yet. \n\n", " The patient is a 48 year old female who experienced a sharp pain in her right knee while jogging. The pain has persisted for 2 weeks. She has an antalgic gait, mild anterior knee tenderness, and a small knee effusion. An anterior drawer test was positive. No imaging has been performed yet.\n\n", " The patient is a 15-year-old male with no significant past medical history. He was playing soccer and tripped on a pothole in the field, twisting his left knee. He felt a pop sensation. On examination, there is knee swelling and effusion, mild medial joint line tenderness. Anterior drawer is equivocal. X-rays show no fracture or dislocation. This is an initial imaging scenario.\n", " The patient is a 65 year old male with a past medical history of diabetes, hypertension, and ascending colon cancer post right hemicolectomy. He has been complaining of chronic right ankle pain that has recently worsened, accompanied by stiffness, particularly when the floor is not smooth or even. He works as an odd job labourer. Upon examination, pes planus was observed, and the patient was stiff when rocking the hindfoot. There was no significant tenderness. X-rays show moderate tibiotalar, subtalar, and talonavicular degeneration.\n", " The patient is a 49 year old male with a past medical history of right wrist fracture post open reduction and internal fixation. He has been experiencing left ankle pain for 8 months, sometimes feeling that the ankle is stuck. An X-ray shows no fracture or dislocation, but mild ankle degeneration. The talar dome is smooth. \n", " The patient is a 70 year old female with a history of diabetes and left breast cancer. She has been experiencing left elbow pain for a year, which has been worsening over the past few months. There is no history of trauma, joint pain/stiffness, or prior imaging. The pain worsens at the end of the day. On examination, crepitus was felt on otherwise full range of motion. There was no point tenderness or obvious effusion.\n\n", " The patient is a 33-year-old male professional tennis player. He has a history of right ankle degeneration and left knee lateral meniscal tear post arthroscopic repair. He is experiencing worsening right elbow pain over the past month, which is worse during tennis and is causing a weakening grip on his racquet. Examination shows extreme tenderness at the lateral epicondyle. X-rays show no fracture, dislocation or elbow effusion.\n", " The patient is a 64 year old female presenting with worsening numbness and tingling along the ulnar aspect of her right hand. She has mild wasting at 4th interosseous and hypothenar eminence. Tinel's positive at cubital tunnel. X-rays show no significant abnormality at elbow or hand apart from mild degeneration.\n", " The patient is a 46 year old male with a history of fatty liver and acute cholecystitis post cholecystectomy. He is currently experiencing severe pain in his right big toe for the past 2 weeks, which improves with paracetamol and ibuprofen. There is swelling and erythema at the right big toe 1st metatarsophalangeal joint. There has been no prior imaging.\n\n", " The patient is a 55-year-old female with bilateral finger joint pain, swelling, and stiffness that is worse in the morning. These symptoms have been present for 4 months and have recently worsened. She has no significant past medical history. Physical examination revealed Heberden's nodes in bilateral distal interphalangeal joints and mild swelling. X-rays show degenerative changes in bilateral hand interphalangeal joints with equivocal gull-wing deformity.\n\n", " The patient is an 80 year old female who has been experiencing right foot pain for 6 months, which worsens after exercise. She engages in a lot of brisk walking. Upon examination, there is tenderness over the metatarsal head/neck regions. She has not had any prior imaging.\n\n", " The patient is a 49-year-old female with a past medical history of fibroids, endometriosis, gestational diabetes, and bilateral breast fibroadenomas. She is currently experiencing bilateral heel pain and stiffness for 5 months, which is worse on the left and when just waking up. Physical examination reveals bilateral pes planus and tenderness at the insertion of the plantar fascia on the calcaneum. Previous X-rays show no significant abnormality, in particular no plantar calcaneal spur.\n\n", " The patient is a 52 year old male who has been experiencing right wrist ulnar sided pain and reduced grip strength for a year. The pain is consistent and worsens with activities. Physical examination shows positive fovea sign and pain on ulnar deviation of the wrist. X-rays show mild degenerative changes in the wrist.\n\n", " The patient is a 46 year old female with a history of obesity, diabetes mellitus, and hyperlipidemia. She has been experiencing numbness, tingling, and weakness in the outer part of her right hand for the past 6 months, sometimes severe enough to wake her up at night. Physical examination revealed positive Tinel's sign and carpal tunnel compression test at the right wrist. X-rays showed no significant abnormality. This is an initial imaging scenario.\n\n", " The patient is a 30 year old female with a painful swelling of the left wrist for about 1 year, mild skin discharge, dorsal wrist swelling with skin sinus tracts and yellowish-cheesy discharge. No tenderness. X-rays shows no gross destructive bone lesion. This is an initial imaging.\n\n", " The patient is a 55 year old female with chronic bilateral hip pain, worse on the right, sometimes with locking sensation. She has pain on internal rotation, adduction and extension of bilateral hips. She has no prior imaging.\n", " The patient is a 22-year-old male with a 5-month history of left hip pain, lateral sided. He is a marathon runner. His pain improves with voltaren and paracetamol, but he does not want to take medication long term. Physical examination reveals tenderness over the left hip greater trochanter. X-rays show no significant abnormality.\n", " The patient is a 30-year-old male with a 4-month history of left anterior hip/groin pain with clicking. The pain aggravates on prolonged sitting and during badminton games. The patient has a positive left hip anterior impingement test. X-rays are unremarkable, with no evidence of hip dysplasia.\n", " The patient is a 27 year old female who is an avid jogger. She has been experiencing bilateral knee pain for 8 months, which is worse on the right and increases when jogging. Physical examination reveals bilateral knee crepitus and small bilateral joint effusions. X-rays show mild bilateral knee degeneration.\n\n", " The patient is a 71 year old male with a history of bilateral knee pain, worse on the left. The pain score is 5/10 and increases to 7/10 during walking. Physical examination reveals significant crepitus in both knees, small bilateral joint effusions. X-rays show severe right and moderate left knee degeneration and small bilateral suprapatellar effusions.\n\n", " The patient is a 16-year-old Caucasian female who is a soccer player. She has a 6-month history of right knee pain following a bad sprain during a soccer game. She felt a pop and swelling at the time of the injury, which was treated with ice, compression, and over-the-counter medication. She has been experiencing right knee pain and a feeling of instability since the injury. The pain worsens with activity. There is no night pain, fever, or loss of weight/appetite. On examination, her right knee anterior drawer is positive, and there is medial and lateral joint line tenderness. There is no joint effusion. X-rays suggest an old Segond fracture.\n\n", " The patient is a 28-year-old male with a 3-month history of right shoulder pain. The pain is exacerbated when bowling and is affecting his bowling ability. The patient has reduced active abduction and positive results for the Empty can test and Neer test. X-rays have shown no reduced acromiohumeral interval. The patient has no significant past medical history.\n\n", " The patient is a 53 year old female with a history of diabetes mellitus, hyperlipidemia, and left breast fibroadenoma. She is experiencing left shoulder pain and stiffness for the past 8 months, which has been worsening over time. She has a reduced range of motion in her left shoulder due to the pain and/or stiffness. X-rays show minimal acromiohumeral degeneration.\n", " The patient is a 41-year-old male who is experiencing right shoulder pain for the past 8 months. He has a history of right shoulder arthroscopic rotator cuff repair 2 years ago. His pain is limiting his ability to participate in competitions. His X-rays show post repair changes but are otherwise unremarkable.\n", " The patient is a 66 year old female who had a total shoulder replacement 1 year ago due to avascular necrosis and secondary osteoarthritis. She is now experiencing worsening left shoulder pain and stiffness over the past 6 months, with limited range of motion due to pain. There has been no recent imaging.\n", " The patient is a 60 year old male who had a right total shoulder replacement 2 years ago for osteoarthritis. He is now complaining of right shoulder pain for the past 2 months. There is pain on range of motion testing. X-rays show equivocal loosening of implant, but otherwise no fracture or gross destructive bone lesion.\n", " The patient is a 58 year old female who had a left total hip replacement 6 months ago due to severe osteoarthritis. She has a past medical history of diabetes, hypertension, and hyperlipidemia. She is currently experiencing left hip pain and difficulty walking. There is pain in her left hip when assessing range of motion.\n", " The patient is an 80 year old male who had a right total hip replacement 3 years ago due to severe osteoarthritis. He has a history of hypertension and is on medications. He is currently experiencing right hip pain for the past 2 days following a fall. His range of motion is limited due to pain. X-rays show no periprosthetic fracture or loosening.\n", " The patient is a 67 year old male with a history of left hip bipolar hemiarthroplasty post neck of femur fracture. He has a past medical history of poorly controlled diabetes, end stage renal failure on peritoneal dialysis, prior intestinal obstruction post small bowel resection due to adhesions, and ischemic heart disease on optimal medical treatment. He is currently presenting with hip pain and fever for 1 week, 1 month post left hip hemiarthroplasty. His examination shows no obvious discharging skin sinus and a limited range of motion due to pain. X-rays show no obvious periprosthetic fracture or loosening, no destructive bone lesion or soft tissue gas. His total white blood cell count and CRP are elevated.\n", " The patient is a 64 year old female who has undergone a right hip bipolar hemiarthroplasty following a neck of femur fracture. She is now experiencing right lateral hip pain 3 months post-operation, particularly when sleeping on her right hip. Physical examination reveals tenderness over the right greater trochanter and pain on forced abduction of the right hip. X-rays do not show any periprosthetic fracture or loosening, or any obvious myositis ossificans.\n", " The patient is a 65 year old male who had a total knee replacement 4 years ago. He has a history of diabetes, hypertension, hyperlipidemia, end stage renal failure on hemodialysis, and cataract post intra-ocular lens. He is currently experiencing severe pain in his left knee after slipping and falling 3 days ago. His left knee is swollen and has a limited range of motion due to pain. X-rays show no obvious periprosthetic fracture or loosening, but there is a large suprapatellar effusion.\n\n", " The patient is a 74 year old female who had a right total knee replacement 1 year ago. She is now presenting with fever, right knee swelling and redness for 4 days. The right knee is moderately swollen, erythematous, tender and warm with no obvious discharge. There is a limited range of motion due to pain. X-rays show no obvious destructive bone lesion or soft tissue gas or periprosthetic loosening or fracture.\n", " The patient is an 11 year old male who had osteosarcoma in the left distal femur. He underwent chemotherapy and limb salvage surgery 1 year ago. He is functionally independent and community ambulant without assistance. There is no obvious limb length discrepancy or palpable mass at the operative site.\n", " The patient is an 80-year-old female with a history of hypertension, hyperlipidemia, and right breast cancer. She has been experiencing low back pain for 5 days. Physical examination reveals mild tenderness at the L1 region and mild kyphosis. X-rays show a moderate compression fracture at L1, osteopenia, and mild lumbar spondylosis.\n", " The patient is a 13-year-old female with a 3-month history of right knee pain, sometimes severe enough to wake her up at night. She is a sprinter for her school. She has mild swelling in her right knee but no other remarkable findings on examination. She has no prior imaging.\n\n", " The patient is a 17-year-old female with no prior medical history. She has been experiencing right thigh dull pain for 2 months, which sometimes worsens at night and affects her ability to dance. The pain improves with naproxen. There is no fever, weight loss, or appetite loss. Examination shows an antalgic gait but no gross mass palpated at the right thigh. The right hip and knee have a full range of motion and there is no limb length discrepancy. X-rays suggest the possibility of an osteoid osteoma at the right femur shaft.\n\n", " The patient is a 31-year-old male with no past medical history. He fell from a 2nd storey, landing on his right shoulder. He is experiencing severe pain and swelling in the right shoulder, with bruising and inability to assess range of motion due to pain. This is an initial imaging situation.\n", " The patient is a 45 year old male with no past medical history. He is a professional weight lifter who experienced an accident during benchpress where the weight slipped out of his hand and hit his right shoulder. He heard a snapping sound and felt severe pain. His right shoulder is swollen, tender, and mildly deformed. X-rays show a comminuted right humeral neck fracture with no dislocation.\n", " The patient is a 37-year-old female with a lump over her right thigh for 3 months. The lump is smooth, non-tender, mobile, and subcutaneous, approximately 2cm in size. She has no prior medical history but has a family history of gastric cancer. She is worried that the lump may be cancerous.\n\n", " The patient is a 26 year old male with a right foot lump for 2 months that is increasing in size. There is no pain and the patient is able to walk normally. The lump is non-tender and measures 3cm over the dorsum of the mid-forefoot. X-rays show no destructive bone lesion, but the lump shows some calcifications. Non contrast-enhanced ultrasound shows subcutaneous hypoechoic lesion with mildly irregular margins, and few foci of calcification.\n\n", " The patient is an 18 year old male with no prior medical history. He is currently experiencing severe right foot pain after a fast march and cannot walk without assistance. His right foot is mildly swollen and tender on deep palpation of the 2nd and 3rd metatarsals. This is his initial imaging.\n", " The patient is a 23-year-old male professional soccer player who was diagnosed with a stress fracture of the right tibia 3 months ago. He has been pain-free for 2 weeks. Upon examination, there is no tenderness at the shin and no deformity.\n", " The patient is a 69 year old male with a history of diabetes, hypertension, hyperlipidemia, peripheral vascular disease post multiple balloon angioplasties, and chronic renal disease. He is currently experiencing left foot swelling and redness for 2 weeks, and it is painful for him to walk. There has been no prior imaging.\n", " The patient is a 30 year old Caucasian male with no prior medical history. He has been involved in a road traffic accident due to drink driving. He is currently intoxicated and in a cervical collar. He has positive chest and pelvic compression and ecchymosis over the abdomen in a seat-belt injury. There has been no prior imaging.\n", " The patient is a 41-year-old male with no prior medical history. He was involved in a road traffic accident and is now presenting with reduced power in both lower limbs and a slightly lax anal tone. X-rays show a T12 chance fracture.\n", " The patient is a 48 year old male with a history of fatty liver and hyperlipidemia. He is currently experiencing low back pain for 3 days after a cricket match. There is no radiation to the groin or lower limbs, and he is able to walk. Urination and bowel motion are normal, and there is no fever. On examination, the straight leg raise test is positive. Power in bilateral lower limbs is full. There has been no prior imaging.\n\n", " The patient is a 73 year old female with a past history of osteoarthritis of bilateral knees post bilateral total knee replacement. She is now presenting with low back pain for 6 days. There is a mild step deformity at L2 region. There has been no prior imaging.\n", " The patient is a 46 year old Caucasian female with a history of systemic lupus erythematosus. She is currently experiencing worsening numbness and tingling in all 4 limbs, uncoordinated movements, and difficulty controlling continence. On examination, she has reduced pinprick sensation in both hands and feet, and her power in all 4 limbs is 3 to 4 out of 5. Her anal tone is equivocally lax. She has not had any prior imaging.\n", " The patient is a 73 year old male with a history of end stage diabetic nephropathy on haemodialysis. He has been experiencing lower back pain for the past 2 months with occasional night pain. He also has radicular pain of the left lower limb. There is mild tenderness at the L3-L4 region. There is no prior imaging.\n", " The patient is a 70 year old male with a history of diabetes, hyperlipidemia and hypertension. He has been experiencing worsening neck pain for the past 6 months, with no radiculopathy or night pain. There is no history of recent trauma. Clinical examination reveals mild midline tenderness over the cervical spine with limited range of motion, but no focal neurological deficit.\n", " The patient is a 60 year old female. She has been experiencing left wrist swelling and redness for 1 week. There is no history of trauma or fever. On examination, her left wrist is warm, swollen, and tender. She has not had any prior imaging.\n", " 48 year old Caucasian male\n", " The patient is an 8 year old Indian male. No symptoms, previous diagnosis, stage of diagnosis, or suspected conditions are provided.\n", " 19 year old Chinese male\n", " 31 year old Malay female\n", " The patient is a 55 year old Chinese female. No symptoms, previous diagnosis, stage of diagnosis, or suspected conditions are provided.\n", " 34 year old Indian male\n", " 24 year old Indian female\n", " 22 year old Malay male\n", " 28 year old male\n", " 58 year old Chinese male\n"], "guidelines": [["shoulder pain traumatic"], ["inflammatory back pain"], ["acute hand and wrist trauma"], ["acute hand and wrist trauma"], ["acute hand and wrist trauma"], ["acute hip pain suspected fracture"], ["acute hip pain suspected fracture"], ["acute trauma to ankle"], ["acute trauma to ankle"], ["acute trauma to foot"], ["acute trauma to knee"], ["acute trauma to knee"], ["acute trauma to knee"], ["chronic ankle pain"], ["chronic ankle pain"], ["chronic elbow pain"], ["chronic elbow pain"], ["chronic hand and wrist pain"], ["chronic foot pain"], ["chronic hand and wrist pain"], ["chronic foot pain"], ["chronic foot pain"], ["chronic hand and wrist pain"], ["chronic hand and wrist pain"], ["chronic hand and wrist pain"], ["chronic hip pain"], ["chronic hip pain"], ["chronic hip pain"], ["chronic knee pain"], ["chronic knee pain"], ["chronic knee pain"], ["chronic shoulder pain"], ["chronic shoulder pain"], ["chronic shoulder pain"], ["imaging after shoulder arthroplasty"], ["imaging after shoulder arthroplasty"], ["imaging after total hip arthroplasty"], ["acute hip pain suspected fracture"], ["imaging after total hip arthroplasty"], ["imaging after total hip arthroplasty"], ["imaging after total knee arthroplasty"], ["imaging after total knee arthroplasty"], ["aggressive primary msk tumour staging and surveillance"], ["management of vertebral compression fracture"], ["chronic knee pain"], ["primary bone tumours"], ["shoulder pain traumatic"], ["shoulder pain traumatic"], ["soft tissue mass"], ["soft tissue mass"], ["acute trauma to foot"], ["stress fracture including sacrum"], ["suspected om foot in dm"], ["suspected spine trauma"], ["suspected spine trauma"], ["low back pain"], ["low back pain"], ["myelopathy"], ["low back pain"], ["cervical neck pain radiculopathy"], ["chronic hand and wrist pain"], [], [], [], [], [], [], [], [], [], []]}