{"profiles": ["The patient is a 22-year-old male with right shoulder pain for 2 weeks following a rugby match. He has a reduced range of motion and tenderness in the shoulder. His Sulcus sign, Apprehension test, and O'Brien test are all positive. An initial shoulder X-Ray shows no fracture or dislocation.", "The patient is a 43-year-old Indian male with a known diagnosis of ankylosing spondylitis. He is currently on infliximab treatment. There are no breakthrough symptoms, no fever, loss of weight/appetite, abnormal sensation/weakness, or shortness of breath. A baseline MRI was done before treatment.", "The patient is a 38-year-old male with no significant past medical history. He had an accident with a power drill which resulted in a penetrating injury to his right wrist. The patient is experiencing pain and swelling in the wrist, and range of motion could not be assessed due to the pain. No imaging has been performed yet.", "The patient is a 17-year-old female with persistent pain in her left hand following a possible splinter penetration during a wood crafting workshop. There is mild swelling at the left thenar eminence and tenderness, but no significant erythema or obvious foreign body. Initial X-rays were unremarkable.", "The patient is a 28-year-old Chinese female with no significant past medical history. She experienced pain at the lateral aspect of her right hand after a kickboxing sparring session. Upon examination, there was a deformity over her right 4th metacarpophalangeal joint, which was tender and swollen. X-rays showed a 4th metacarpophalaneal joint dislocation, but no fracture.", "The patient is a 78-year-old female with a history of diabetes mellitus and hypertension. She tripped and fell and is now unable to walk due to left hip pain. Her left limb is foreshortened, externally rotated, and has a reduced range of motion due to pain. No imaging has been performed yet.", "The patient is a 45 year old female with a history of end stage renal failure, anemia, hypertension, and chronic headache. She slipped in the bathroom and is now unable to get up due to right hip pain. There is a reduced range of motion in her right hip due to the pain. X-rays show no obvious hip fracture or dislocation.", "The patient is a 50-year-old male with a history of hypertension. He experienced a twisting injury to his right ankle while jogging a week ago and has had pain since then. He was able to continue jogging immediately after the incident and is currently able to walk normally. There is mild pain on foot supination, but no point tenderness at the right ankle or midfoot. There has been no prior imaging.", "The patient is a 17-year-old male with no significant past medical history. He was injured while playing soccer, resulting in a twisted right ankle. He was unable to walk for about 10 minutes after the incident but was subsequently able to bear weight with assistance. Examination revealed point tenderness at the tip of the lateral malleolus and abnormal widening of the lateral ankle on varus stress. X-rays showed no fracture, dislocation, or osteochondral injury.", "The patient is a 24-year-old male with no significant past medical history. He is a construction worker who had a large trolley carrying metal poles roll over his left foot. He is experiencing severe pain and is unable to walk without assistance. Upon examination, there is tenderness over the midfoot/base of the forefoot and severe foot swelling. X-rays show equivocal widening of the interval between the base of the 1st and 2nd metatarsals, but no definite fracture.", "The patient is a 62-year-old Caucasian female who was involved in a car accident where her left knee hit the dashboard. She is experiencing severe swelling and pain in her left knee, and no range of motion or stress maneuvers could be performed due to the pain. No imaging has been performed yet.", "The patient is a 48-year-old female who experienced a sharp pain in her right knee while jogging. The pain has persisted for 2 weeks. She is still able to walk but has an antalgic gait, mild anterior knee tenderness, and a small knee effusion. The anterior drawer test is positive. No imaging has been performed yet.", "The patient is a 15-year-old male with no significant past medical history. He was playing soccer and tripped on a pothole, twisting his left knee and feeling a pop sensation. His examination shows knee swelling and effusion, mild medial joint line tenderness, and an equivocal anterior drawer. X-rays show no fracture or dislocation.", "The patient is a 65-year-old male with a past medical history of diabetes, hypertension, and ascending colon cancer post right hemicolectomy. He has been experiencing right ankle pain for years, which has recently worsened, accompanied by stiffness, particularly when the floor is not smooth or even. He works as an odd job labourer. Upon examination, pes planus was observed, and the patient was stiff when rocking the hindfoot. There was no significant tenderness. X-rays show moderate tibiotalar, subtalar, and talonavicular degeneration.", "The patient is a 49 year old male with a past medical history of right wrist fracture post open reduction and internal fixation. He has been experiencing left ankle pain for 8 months without any known cause. He sometimes feels that his ankle is stuck but the feeling goes away after a while. An X-ray shows no fracture or dislocation, but mild ankle degeneration and a smooth talar dome.", "The patient is a 70-year-old female with a past medical history of diabetes and left breast cancer. She has been experiencing left elbow pain for a year, which has been worsening over the past few months. There is no history of trauma, joint pain/stiffness, or prior imaging. The pain worsens at the end of the day. On examination, crepitus was felt on otherwise full range of motion. There was no point tenderness or obvious effusion.", "The patient is a 33-year-old male professional tennis player. He has a history of right ankle degeneration and left knee lateral meniscal tear post arthroscopic repair. He is experiencing worsening right elbow pain over the past month, which is worse during tennis and is causing a weakening grip on his racquet. Examination shows extreme tenderness at the lateral epicondyle. X-rays show no fracture, dislocation, or elbow effusion.", "The patient is a 64-year-old Chinese female. She is experiencing worsening numbness and tingling along the ulnar aspect of her right hand. On examination, there is mild wasting at the 4th interosseous and hypothenar eminence. Tinel's is positive at the cubital tunnel. X-rays show no significant abnormality at the elbow or hand apart from mild degeneration. The patient has a history of hyperlipidemia and is on statins.", "The patient is a 46-year-old male with a history of fatty liver and acute cholecystitis post cholecystectomy. He is currently experiencing severe pain in his right big toe for the past 2 weeks, which improves with paracetamol and ibuprofen. Upon examination, there is swelling and erythema at the right big toe's 1st metatarsophalangeal joint. This is the initial imaging stage, and there is no prior imaging.", "The patient is a 55-year-old female with no significant past medical history. She has been experiencing bilateral finger joint pain, swelling, and stiffness that is worse in the morning for the past 4 months, and the symptoms have been worsening recently. There is no other joint involvement. Physical examination revealed Heberden's nodes in the bilateral distal interphalangeal joints and mild swelling. X-rays show degenerative changes in bilateral hand interphalangeal joints with an equivocal gull-wing deformity.", "The patient is an 80-year-old female who has been experiencing right foot pain for 6 months, which worsens after exercise. She engages in a lot of brisk walking. Upon examination, there is tenderness over the metatarsal head/neck regions. She has a history of total hysterectomy and bilateral salpingo-oophrectomy for endometrial cancer 20 years ago. There has been no prior imaging.", "The patient is a 49-year-old Indian female with a past medical history of fibroids, endometriosis, gestational diabetes, and bilateral breast fibroadenomas. She is currently experiencing bilateral heel pain and stiffness for 5 months, which is worse on the left and when just waking up. She is perimenopausal. On examination, she has bilateral pes planus and is tender at the insertion of the plantar fascia on the calcaneum. X-rays show no significant abnormality, in particular no plantar calcaneal spur.", "The patient is a 52-year-old male who has been experiencing right wrist ulnar sided pain and reduced grip strength for a year. The pain is consistent and worsens with activities. He is unable to play badminton properly due to this condition. Physical examination reveals a positive fovea sign and pain is elicited on ulnar deviation of the wrist. X-rays show mild non-specific degenerative changes in the wrist.", "The patient is a 46-year-old female with a history of obesity, diabetes mellitus, and hyperlipidemia. She has been experiencing numbness, tingling, and weakness in the outer part of her right hand for the past 6 months, sometimes severe enough to wake her up at night. Physical examination revealed positive Tinel's sign and carpal tunnel compression test at the right wrist. There is no significant thenar atrophy. X-rays show no significant abnormality.", "The patient is a 30-year-old female who has been experiencing painful swelling of the left wrist for about a year. She also has mild skin discharge. Upon examination, dorsal wrist swelling with skin sinus tracts and yellowish-cheesy discharge was observed. X-rays show no gross destructive bone lesion.", "The patient is a 55 year old female with a history of being a national sprinter. She is presenting with chronic bilateral hip pain that is worse on the right side, and sometimes experiences a locking sensation. She has pain on internal rotation, adduction and extension of bilateral hips. There has been no prior imaging.", "The patient is a 22-year-old male with a 5-month history of left hip pain, lateral sided. He is a marathon runner. His pain improves with voltaren and paracetamol, but he does not want to take these medications long term. On examination, he is tender over the left hip greater trochanter. X-rays show no significant abnormality.", "The patient is a 30-year-old male with no significant past medical history. He is an office worker and plays badminton three times a week. He has been experiencing left anterior hip/groin pain with clicking for the past 4 months. The pain is mostly in the background with a pain score of 3-4/10, but it worsens during prolonged sitting and during badminton games. Upon examination, no inguinal hernia was found, but a positive left hip anterior impingement test was noted. X-rays showed no evidence of hip dysplasia.", "The patient is a 27-year-old Chinese female who is an avid jogger. She has been experiencing bilateral knee pain for 8 months, which is worse on the right side. The pain score is about 4-5/10, but it increases to 7-8/10 when jogging. There is no fever or night pain. Physical examination reveals bilateral knee crepitus, no joint line tenderness, pivot shift negative, anterior and posterior drawer negative, varus/valgus stress negative, and small bilateral joint effusions. X-rays show mild bilateral knee degeneration.", "The patient is a 71-year-old male with a history of lung cancer and ischemic heart disease. He is currently experiencing bilateral knee pain, which is worse on the left and exacerbated by walking. Physical examination reveals significant crepitus and small bilateral joint effusions in both knees. X-rays show severe right and moderate left knee degeneration and small bilateral suprapatellar effusions.", "The patient is a 16-year-old Caucasian female who is a soccer player. She has a 6-month history of right knee pain following a bad sprain during a soccer game. She experienced a pop and swelling at the time of the injury, which was treated with ice, compression, and over-the-counter medication. She has been experiencing right knee pain and a feeling of instability since the injury, with the pain worsening during activity. There is no night pain, fever, or loss of weight/appetite. Examination revealed a positive right knee anterior drawer, medial and lateral joint line tenderness, and no joint effusion. X-rays suggest an old Segond fracture.", "The patient is a 28-year-old male with a 3-month history of right shoulder pain. The pain is exacerbated when bowling and is affecting his bowling ability. On examination, he has reduced active abduction, a positive empty can test, and a positive Neer test. His X-rays are unremarkable, with no reduced acromiohumeral interval. This is an initial imaging scenario.", "The patient is a 53-year-old female with a history of diabetes mellitus, hyperlipidemia, and left breast fibroadenoma. She is currently experiencing left shoulder pain and stiffness for the past 8 months, which has been worsening over time. She has a significantly reduced range of motion in her left shoulder due to pain and/or stiffness. X-rays show minimal acromiohumeral degeneration. This is an initial imaging stage.", "The patient is a 41-year-old male who is a badminton player. He has a history of right shoulder arthroscopic rotator cuff repair 2 years ago. He is now presenting with an 8-month history of right shoulder pain, which is limiting his ability to participate in competitions. His grip strength is okay and he has no night pain or fever. On examination, his impingement test is positive and he has reduced abduction due to pain. X-rays show post repair changes but are otherwise unremarkable.", "The patient is a 66-year-old female who had a left total shoulder replacement 1 year ago due to avascular necrosis and secondary osteoarthritis. She has a past medical history of hypertension and colonic polyps post polypectomy. She is currently experiencing worsening left shoulder pain and stiffness over the past 6 months, with limited range of motion due to pain. There has been no recent imaging.", "The patient is a 60-year-old male who had a right total shoulder replacement 2 years ago due to osteoarthritis. He is currently experiencing right shoulder pain for the past 2 months. He has a past medical history of chronic obstructive pulmonary disease and lung cancer. His X-rays show equivocal loosening of the implant, but no fracture or gross destructive bone lesion.", "The patient is a 58-year-old female who had a left total hip replacement for severe osteoarthritis 6 months ago. She has a past medical history of diabetes, hypertension, and hyperlipidemia. She is currently presenting with left hip pain and difficulty walking. There is pain in her left hip when assessing range of motion.", "The patient is an 80-year-old Caucasian male who had a right total hip replacement for severe osteoarthritis 3 years ago. He has a history of hypertension and is on medications. He is now presenting with a 2-day history of right hip pain after a fall. His range of motion assessment is limited by pain. X-rays show no periprosthetic fracture or loosening.", "The patient is a 67-year-old male with a history of left hip bipolar hemiarthroplasty post neck of femur fracture. He has a past medical history of poorly controlled diabetes, end stage renal failure on peritoneal dialysis, prior intestinal obstruction post small bowel resection due to adhesions, and ischemic heart disease on optimal medical treatment. He is currently presenting with hip pain and fever for 1 week, 1 month post left hip hemiarthroplasty. His examination shows no obvious discharging skin sinus and limited range of motion due to pain. X-rays show no obvious periprosthetic fracture or loosening, no destructive bone lesion or soft tissue gas. His total white blood cell count and CRP are elevated.", "The patient is a 64-year-old female who has undergone right hip bipolar hemiarthroplasty following a neck of femur fracture. She is now experiencing right lateral hip pain three months post-operation, particularly when sleeping on her right hip. Physical examination reveals tenderness over the right greater trochanter and pain on forced abduction of the right hip. X-rays have ruled out periprosthetic fracture or loosening, and myositis ossificans.", "The patient is a 65-year-old male who had a total knee replacement on his left knee 4 years ago. He has a past medical history of diabetes, hypertension, hyperlipidemia, end stage renal failure on hemodialysis, and cataract post intra-ocular lens. He is currently experiencing severe pain in his left knee after slipping and falling 3 days ago. His left knee is swollen and has a limited range of motion due to pain. X-rays show no obvious periprosthetic fracture or loosening, but there is a large suprapatellar effusion.", "The patient is a 74 year old female who had a right total knee replacement 1 year ago. She is now presenting with fever, right knee swelling and redness for 4 days. The right knee is moderately swollen, erythematous, tender and warm with no obvious discharge. There is a limited range of motion due to pain. X-rays show no obvious destructive bone lesion or soft tissue gas or periprosthetic loosening or fracture.", "The patient is an 11-year-old male who had osteosarcoma in the left distal femur. He underwent chemotherapy and limb salvage surgery 1 year ago. He is functionally independent and can walk without assistance. There is no obvious limb length discrepancy or palpable mass at the operative site.", "The patient is an 80-year-old female with a history of hypertension, hyperlipidemia, and right breast cancer post simple mastectomy and sentinel node biopsy 20 years ago. She is currently presenting with low back pain for 5 days, with no inciting event recalled. On examination, there is mild tenderness at the L1 region and she is mildly kyphotic. X-rays show L1 moderate compression fracture, osteopenia, and mild lumbar spondylosis.", "The patient is a 13-year-old Caucasian female with no prior medical history. She is a sprinter for her school. She has been experiencing right knee pain for the past 3 months, which sometimes wakes her up at night. There is no history of trauma, fever, weight loss, or loss of appetite. On examination, there is mild swelling in her right knee. She has not had any prior imaging.", "The patient is a 17-year-old Malay female with no prior medical history. She is a dancer and is currently experiencing a 2-month history of right thigh dull pain, which sometimes worsens at night and affects her ability to dance. The pain improves with naproxen. She has no fever, no loss of weight or appetite. Upon examination, she has an antalgic gait but no gross mass palpated at the right thigh. Her right hip and knee have a full range of motion and there is no limb length discrepancy. X-rays suggest the possibility of an osteoid osteoma at the right femur shaft.", "The patient is a 31-year-old male with no past medical history. He fell from the second storey during rappelling today, landing on his right shoulder. He is experiencing severe pain and swelling in the right shoulder, with bruising and inability to assess range of motion due to pain. There is no prior imaging.", "The patient is a 45-year-old male with no past medical history. He is a professional weight lifter who experienced an accident during benchpress where the weight slipped out of his hand and hit his right shoulder. He heard a snapping sound and felt severe pain. Physical examination revealed marked right shoulder swelling, tenderness, and mild deformity. X-rays show a comminuted right humeral neck fracture with no dislocation.", "The patient is a 37-year-old female with a lump on her right thigh that has been present for 3 months. The lump is smooth, non-tender, mobile, and subcutaneous, measuring approximately 2cm in size. The patient has no prior medical history but has a family history of gastric cancer. She is worried that the lump may be cancerous.", "The patient is a 26-year-old Caucasian male with no prior medical history. He has been experiencing a right foot lump for 2 months, which has been increasing in size. There is no associated fever, weight loss, or loss of appetite. There was no inciting traumatic event and the patient experiences no pain and is able to walk normally. Examination reveals a 3cm lump over the dorsum of the mid-forefoot, which is non-tender. X-rays show no destructive bone lesion, but the lump shows some calcifications. A non-contrast-enhanced ultrasound shows a subcutaneous hypoechoic lesion with mildly irregular margins, and a few foci of calcification.", "The patient is an 18-year-old male with no prior medical history. He is currently experiencing severe right foot pain after a fast march and cannot walk without assistance. His right foot is mildly swollen and tender on deep palpation of the 2nd and 3rd metatarsals. This is an initial imaging situation as there has been no prior imaging.", "The patient is a 23-year-old male professional soccer player. He was diagnosed with a stress fracture of the right tibia 3 months ago. He has been pain-free for 2 weeks. Upon examination, there is no tenderness at the shin and no deformity.", "The patient is a 69 year old male with a past medical history of diabetes, hypertension, hyperlipidemia, peripheral vascular disease post multiple balloon angioplasties, and chronic renal disease. He is currently presenting with left foot swelling and redness for 2 weeks, and it is painful for him to walk. There has been no prior imaging.", "The patient is a 30 year old Caucasian male with no prior medical history. He has been involved in a road traffic accident due to drink driving. He is currently intoxicated and in a cervical collar. He has positive chest and pelvic compression and ecchymosis over the abdomen due to a seat-belt injury. There has been no prior imaging.", "The patient is a 41-year-old male with no prior medical history. He was involved in a road traffic accident and is now presenting with reduced power in both lower limbs and a slightly lax anal tone. X-rays have revealed a T12 chance fracture. This is the initial imaging stage.", "The patient is a 48-year-old male with a history of fatty liver and hyperlipidemia. He is currently experiencing low back pain for 3 days after a cricket match. There is no radiation to the groin or lower limbs, and he is able to walk. Urination and bowel motion are normal, and there is no fever. On examination, the straight leg raise test is positive. Power in bilateral lower limbs is full. There has been no prior imaging.", "The patient is a 73 year old female with a past history of osteoarthritis of bilateral knees post bilateral total knee replacement. She is now presenting with low back pain for 6 days. There is a mild step deformity at L2 region on examination. There has been no prior imaging.", "The patient is a 46 year old Caucasian female with a history of systemic lupus erythematosus. She is currently experiencing worsening numbness and tingling in all 4 limbs, uncoordination, and difficulty controlling continence. On examination, she has reduced pinprick sensation in both hands and feet, power in all 4 limbs is 3 to 4 out of 5, and anal tone is equivocally lax. There is no sensory level. This is the initial imaging stage as there is no prior imaging.", "The patient is a 73 year old male with a history of end stage diabetic nephropathy on haemodialysis. He has been experiencing lower back pain for the past 2 months, with occasional night pain. He also has radicular pain in his left lower limb. There is mild tenderness at the L3-L4 region. There is no prior imaging.", "The patient is a 70 year old male with a history of diabetes, hyperlipidemia and hypertension. He has been experiencing worsening neck pain for the past 6 months, with no radiculopathy or night pain. There is no history of recent trauma. Clinical examination reveals mild midline tenderness over the cervical spine with limited range of motion, but no focal neurological deficit.", "The patient is a 60 year old female with symptoms of left wrist swelling, redness, and tenderness for 1 week. There is no history of trauma or fever. The patient has not had any prior imaging.", "48 year old Caucasian male", "The patient is an 8 year old Indian male. No symptoms, previous diagnosis, stage of diagnosis, or suspected conditions are provided in the profile.", "The patient is a 19 year old Chinese male. No symptoms, previous diagnosis, stage of diagnosis, or suspected conditions are provided in the profile.", "The patient is a 31 year old Malay female. No symptoms, previous diagnosis, stage of diagnosis, or suspected conditions are provided in the profile.", "The patient is a 55 year old Chinese female. No symptoms, previous diagnosis, stage of diagnosis, or suspected conditions are provided in the profile.", "34 year old Indian male", "The patient is a 24 year old Indian female. No symptoms, previous diagnosis, stage of diagnosis, or suspected conditions are provided in the profile.", "The patient is a 22 year old Malay male. No symptoms, previous diagnosis, stage of diagnosis, or suspected conditions are provided in the profile.", "The patient is a 28 year old male.", "The patient is a 58 year old Chinese male. No symptoms, previous diagnosis, stage of diagnosis, or suspected conditions are provided in the profile."], "guidelines": [["shoulder pain traumatic", "chronic shoulder pain"], ["inflammatory back pain"], ["acute hand and wrist trauma"], ["acute hand and wrist trauma", "chronic hand and wrist pain"], ["acute hand and wrist trauma"], ["acute hip pain suspected fracture"], ["acute hip pain suspected fracture"], ["acute trauma to ankle", "chronic ankle pain"], ["acute trauma to ankle"], ["acute trauma to foot"], ["acute trauma to knee"], ["acute trauma to knee", "chronic knee pain"], ["acute trauma to knee"], ["chronic ankle pain"], ["chronic ankle pain"], ["chronic elbow pain"], ["chronic elbow pain"], ["chronic hand and wrist pain", "chronic elbow pain"], ["chronic foot pain", "suspected om septic arthritis soft tissue infection"], ["chronic hand and wrist pain"], ["chronic foot pain", "stress fracture including sacrum"], ["chronic foot pain"], ["chronic hand and wrist pain"], ["chronic hand and wrist pain"], ["chronic hand and wrist pain", "suspected om septic arthritis soft tissue infection"], ["chronic hip pain"], ["chronic hip pain"], ["chronic hip pain"], ["chronic knee pain"], ["chronic knee pain", "imaging after total knee arthroplasty"], ["chronic knee pain", "acute trauma to knee"], ["chronic shoulder pain"], ["chronic shoulder pain"], ["chronic shoulder pain", "imaging after shoulder arthroplasty"], ["imaging after shoulder arthroplasty", "chronic shoulder pain"], ["imaging after shoulder arthroplasty", "chronic shoulder pain"], ["imaging after total hip arthroplasty", "chronic hip pain"], ["acute hip pain suspected fracture", "imaging after total hip arthroplasty"], ["imaging after total hip arthroplasty", "suspected om septic arthritis soft tissue infection", "chronic hip pain"], ["imaging after total hip arthroplasty", "chronic hip pain"], ["imaging after total knee arthroplasty", "acute trauma to knee"], ["imaging after total knee arthroplasty", "suspected om septic arthritis soft tissue infection"], ["aggressive primary msk tumour staging and surveillance"], ["low back pain", "management of vertebral compression fracture"], ["chronic knee pain", "stress fracture including sacrum"], ["primary bone tumours", "chronic hip pain"], ["acute hand and wrist trauma", "shoulder pain traumatic"], ["acute hand and wrist trauma", "shoulder pain traumatic"], ["soft tissue mass"], ["soft tissue mass", "chronic foot pain"], ["acute trauma to foot", "stress fracture including sacrum"], ["stress fracture including sacrum"], ["acute trauma to foot", "chronic foot pain", "suspected om foot in dm", "suspected om septic arthritis soft tissue infection"], ["acute trauma to knee", "suspected spine trauma", "management of vertebral compression fracture"], ["suspected spine trauma", "management of vertebral compression fracture"], ["low back pain"], ["low back pain", "imaging after total knee arthroplasty"], ["myelopathy"], ["low back pain", "inflammatory back pain", "myelopathy"], ["cervical neck pain radiculopathy"], ["acute hand and wrist trauma", "chronic hand and wrist pain", "suspected om septic arthritis soft tissue infection"], [], [], [], [], [], [], [], [], [], []]}